Repository: common-repository/boot-modal
Catalog: lang/bootmodal-*.po
Languages: fr_fr

source: Permalink unknow (Boot-modal)
fr_fr: Permalien inconnu (Boot-modal)

source: Close
fr_fr: Fermer

source: Load a page in a Boostrap's modal
fr_fr: Charger une page dans une fenêtre modale Boostrap

source: How to use this plugin ?
fr_fr: Comment utiliser ce plugin ?

source: Plugin settings
fr_fr: Paramètres du plugin

source: Shortcode options
fr_fr: Options du shortcode

source: To donate
fr_fr: Pour faire un don

source: Set up Bootstrap
fr_fr: Configurer Bootstrap

source: If your template does not use Boostrap, activate a light version within the parameters of the plugin.
fr_fr: Si votre template n’utilise pas Bootstrap, vous devez activer la version light disponible dans les paramètres du plugin.

source: Use a shortcode
fr_fr: Utiliser un shortcode

source: Insert the shortcode [bootmodal post="page"] anywhere to place a link for opening the modal window or use the shortcode generator in the editor.
fr_fr: Insérer le shortcode [bootmodal post="page"] n’importe où pour créer un lien afin d’ouvrir une fenêtre modale ou utiliser le générateur de shortcode dans l’éditeur.

source: Post parameter is the final section of the permalink of the article you want to display in the modal window.
fr_fr: Le paramètre post correspond à la dernière partie du permalien de l’article que vous souhaitez afficher dans la fenêtre modale.

source: Indulge yourself
fr_fr: Faites vous plaisir

source: Normally it works ...
fr_fr: Normalement, ça marche…

source: You are happy now ! So smile ! And look at the options available and make me a donation if I changed your life ! Or not...
fr_fr: Vous êtes heureux maintenant ! Donc souriez ! Et faites le tour des options et profitez en pour me faire un don si j’ai changé votre vie ! Ou pas…

source: required
fr_fr: obligatoire

source: This parameter determines which page or which item should be displayed in the modal window.
fr_fr: Ce paramètre détermine quelle page ou article doit être affiché dans la fenêtre modale.

source: This corresponds to the last part of the permalink articles.
fr_fr: Cela correspond à la dernière partie du permalien d’un article ou d’une page.

source: Choose whether to activate the animation when displaying the modal window.
fr_fr: Choisir d’activer l’animation lors de l’affichage de la fenêtre modale.

source: Possible values
fr_fr: Valeurs possibles

source: yes or no
fr_fr: yes ou no

source: Customizes the link/button CSS class.
fr_fr: Personnalisez la classe CSS associée au lien/bouton.

source: All you want as long as it is a CSS class.
fr_fr: Tout ce que vous voulez tant que c’est une class CSS.

source: Choose the text for the link or the HTML button. If you don't choose your own text, the text will be the title of the post to open.
fr_fr: Choisissez le texte pour le lien ou le bouton HTML. Si vous ne choisissez pas votre propre texte, le texte sera le titre de l’article à ouvrir.

source: Choose whether to insert a link or an HTML button.
fr_fr: Utilisez ce paramètre si vous souhaitez insérer un lien ou un button en HTML.

source: Link
fr_fr: Lien

source: Button
fr_fr: Bouton

source: Customize the CSS class associated with the modal window close button.
fr_fr: Personnaliser la classe CSS associée au bouton de fermeture de la fenêtre modale.

source: Text to display in the close button of the modal window.
fr_fr: Texte à afficher dans le bouton de fermeture de la fenêtre modale.

source: Do not close other modal windows open when you open a new one.
fr_fr: Ne pas fermer les autres fenêtres modales ouvertes lorsque vous en ouvrez une nouvelle.

source: This parameter defines the size of the modal window.
fr_fr: Ce paramètre permet de définir la taille de la fenêtre modale.

source: Leave empty
fr_fr: Laissez vide

source: Small
fr_fr: Petit

source: This parameter make possible to send a parameter in the URL for the page being opened in the modal. This makes it possible to customize the content of the page. The parameter consists of a url_key (parameter name) and url_value (Warning : work only with link and not with button).
fr_fr: Ce paramètre permet d’envoyer un paramètre dans l’URL de la page en cours d’ouverture dans le modal. Cela rend possible de personnaliser le contenu de la page. Le paramètre se compose d’un url_key (nom du paramètre) et url_value (attention : fonctionne uniquement avec le lien et pas avec le bouton).

source: If you want to encourage me to create other plugins or improve this one, you can donate something with Paypal ! If you have no money your are free to use this plugin and enjoy !
fr_fr: Si vous voulez m’encourager à créer d’autres plugin ou à améliorer celui-ci. Vous pouvez me faire un petit don Paypal. Si vous n’avez pas d’argent, vous pouvez évidemment utiliser ce plugin et en profiter !

source: yes
fr_fr: oui

source: no
fr_fr: non

source: button
fr_fr: bouton

source: link
fr_fr: lien

source: small
fr_fr: petit

source: Bootstrap activation
fr_fr: Activation de Bootstrap

source: Activate Bootstrap
fr_fr: Activer Bootstrap

source: Choose "no" if Bootstrap is already used by your theme or another plugin.
fr_fr: Choisissez « non » si Bootstrap est déjà utilisé par votre thème ou un autre plugin.

source: Link params
fr_fr: Paramètres du lien

source: Link type
fr_fr: Type du lien

source: CSS class
fr_fr: Classe CSS

source: CSS class of the button to open the modal (default: btn btn-default).
fr_fr: La classe CSS du bouton pour ouvrir la fenêtre modale (par défaut : btn btn-default).

source: Modal window params
fr_fr: Paramètres de la fenêtre modale

source: Close button text
fr_fr: Texte du bouton de fermeture

source: Texte of the button inside the modal to close it.
fr_fr: Texte du bouton à l’intérieur de la modale pour la fermer.

source: Close button CSS class
fr_fr: Classe CSS du bouton de fermeture

source: CSS class of the button inside the modal to close it (default: btn btn-default).
fr_fr: La classe CSS du bouton à l’intérieur de la fenêtre modale pour la fermer (par défaut : btn btn-default).

source: Choose "no" if you do not want to animate the modal.
fr_fr: Choisissez « non » si vous ne voulez pas animer la fenêtre modale lors de l’ouverture.

source: Modal window size
fr_fr: Taille de la fenêtre modale

source: Editor params
fr_fr: Paramètres de l’éditeur

source: Button in editor
fr_fr: Bouton dans l’éditeur

source: Add a button in editor to add the shortcode
fr_fr: Ajouter un bouton dans l’éditeur afin d’ajouter le shortcode

source: Add a Boot-Modal shortcode
fr_fr: Ajouter un shortcode Boot-Modal

source: Post permalink
fr_fr: Permalien de la publication

source: Link text
fr_fr: Lien texte

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Add URL params
fr_fr: Ajouter un paramètre à l’URL

source: Key
fr_fr: Clé

source: Value
fr_fr: Valeur

source: Other options
fr_fr: Autres options

source: Dismiss others windows
fr_fr: Fermer les autres fenêtres

source: A simple plugin to open any page in a Bootstrap modal window.
fr_fr: Un plugin simple pour ouvrir une page dans un fenêtre modale Bootstrap.
